app/controllers/recipes_controller.rb

SELECT `recipes`.* FROM `recipes`
---
	def index
		@recipes = Recipe.all

INSERT INTO `recipes` (`name`, `recipe`, `pic_file_name`, `pic_content_type`, `pic_file_size`, `pic_updated_at`, `created_at`, `updated_at`) VALUES ('sadf', 'sdaf', 'minni-apple-krisp.jpg', 'image/jpeg', 1651798, '2016-03-08 23:43:45', '2016-03-08 23:43:47', '2016-03-08 23:43:47')
---
	def create
		@recipe = Recipe.create(recipe_params)

SELECT  `recipes`.* FROM `recipes` WHERE `recipes`.`id` = 1 LIMIT 1
---
	def show
		@recipe = Recipe.find(params[:id])